In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('gapminder.tsv', sep='\t')

In [6]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

### 판다스 용어 정리
#### 시리즈 는 row (열,배열,라인)
#### 데이터프레임은 행렬(시트,테이블) 따라서 시리즈가 요소가 되는 딕셔너리

In [7]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.shape # shape 은 속성

(1704, 6)

In [13]:
df.columns # 데이터타입 object는 판다스에서 string을 뜻한다.

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

### 판다스 / 파이썬 자료형 비교
#### object / string
#### int64 / int
#### float64 / float
#### detetime64 / datetime

In [14]:
df.info() # info 함수는 내부 상세 출력

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

#### 열단위 출력

In [15]:
country_df = df['country']
type(country_df)
# 열단위 (시리즈) 추출은 대괄호와 열 이름 사용
# 열 이름은 반드시 싱글쿼터
# 1개 열 추출은 시리즈, 2개이상 열 추출은 DF 로 추출됨

pandas.core.series.Series

In [16]:
country_df.head() # 최상위 5개 추출

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [20]:
country_df.tail() # 최하위 5개 추철

1699    Zimbabwe
1700    Zimbabwe
1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [22]:
subset = df[['country', 'continent', 'year']] # 리스트에 열이름을 전달하면 여러개의 열을 한번에 추출
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [ ]:
# loc : 인덱스를 기준으로 행 데이터 추출
# iloc : 행번호를 기준으로 행 데이터 추출
# 파이선에서 리스트 같은 자료형에 저장된 순서가 인덱스인 반면, 판다스에서는 행번호가 그 역활을 함

### loc 속성으로 행단위 데이터 추출

In [30]:
df.loc[0] # 대괄호 인덱스 값으로 데이터 출럭, 인덱스는 반드시 0 또는 양의 정수이기때문에 음수가 들어가면 않됨

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [33]:
type(df.loc[0])

pandas.core.series.Series

In [34]:
df.loc[0]['year']

1952

In [38]:
# 마지막 인덱스 값을 추출하는 방법 1
number_of_rows = df.shape[0]
last_row_index = number_of_rows -1
df.loc[last_row_index]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [40]:
# 마지막 인덱스 값을 추출하는 방법 2
df.tail(n=1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [43]:
df.loc[[0,99,999]]
# 인덱스 3개를 한꺼번에 추출하려면 리스트에 원하는 익덱스를 담아 loc 속성에 전달

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [76]:
small_range = list(range(5))
small_range
# range 메소드는 지정한 정수으 ㅣ제너레이터를 반환 
# 리스트에 [0,1,2,3,4] 로 변환후 iloc 지정값에 전달함

[0, 1, 2, 3, 4]

In [77]:
subset = df.iloc[ small_range]
subset.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [78]:
small_range = list(range(3,6)) # 3~5 범위의 정수 리스트 추출
small_range

[3, 4, 5]

In [79]:
small_range = list(range(0,6,2)) # 0 ~ 5 까지 2만큼 컨너 뛰는 제네레이터 생성, (짝수 정수)
small_range

[0, 2, 4]

In [80]:
subset = df.iloc[small_range]
subset.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [82]:
subset = df.iloc[:3]
subset.head() # list(range(3)) 과 [:3] 은 같은 결과

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

### GroupBy

In [84]:
df.groupby('year')['lifeExp'].mean()
# groupby 메소드에 year 열을 전달하여, 연도별로 그룹화 한 다음 lifeExp 열을 지정하여 mean() 메소드로 평균을 구함

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [93]:
multi_group_val = df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean()
multi_group_val.iloc[:10]

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455

In [95]:
df.groupby('continent')['country'].nunique()
# nunique() 메소드는 통계에서 빈도수를 구하는 메소드

continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

In [101]:
# %mapplotlib inline
import matplotlib.pyplot as plt

### 시리즈 만들기

In [ ]:
import pandas as pd

In [102]:
sample = pd.Series(['banana', 42])
sample

0    banana
1        42
dtype: object

### 데이터 프레임 만들기

In [107]:
job =pd.DataFrame(
    data= {
        '업무': ['개발', '유지보수'],
        '시작': ['2018-01-01', '2019-01-01'],
        '종료': ['2018-01-01', '2019-01-01'],
        '기간(년)': [1,2]
    },
    index = ['A팀','B팀'],
    columns = ['업무', '시작', '종료', '기간(년)']
)
job

      업무          시작          종료  기간(년)
A팀    개발  2018-01-01  2018-01-01      1
B팀  유지보수  2019-01-01  2019-01-01      2

In [109]:
first_row = job.loc['B팀']
first_row

업무             유지보수
시작       2019-01-01
종료       2019-01-01
기간(년)             2
Name: B팀, dtype: object

In [110]:
first_row.index

Index(['업무', '시작', '종료', '기간(년)'], dtype='object')

In [111]:
first_row.values

array(['유지보수', '2019-01-01', '2019-01-01', 2], dtype=object)